[
  {
    "title": "Police Dispatch App",
    "description": "Manage Scheduling Private Jobs for Officers",
    "image": "/police-dispatch.png",
    "username": null,
    "password": null,
    "notes": "I joined this project midway through its development. The project uses a NextJS frontend with Material-UI and TypeScript. I've mainly worked on the frontend and have contributed to discussions about the backend, which uses NestJS. The most notable features I've built include a report generator that receives data from the backend to build either a standard table or a table with nested data. Additionally, I developed a messaging form that supports emails, push notifications, and SMS, among many other features and components. I've also made some updates to its mobile app through React Native.",
    "alt": "Site Example",
    "website": "",
    "github": "",
    "privateRepo": true
  },
  {
    "title": "Video Interviewing App",
    "description": "App for Outsourcing Video Interviews",
    "image": "/video-interviewing.png",
    "username": null,
    "password": null,
    "notes": "This app features a NextJS frontend with TypeScript, Tailwind CSS, and Shadcn. I scaffolded many of the app's layouts, cards, and video controls while also integrating some of the data and forms.",
    "alt": "Site Example",
    "website": "",
    "github": "",
    "privateRepo": true
  },
  {
    "title": "Health Commerce Sites",
    "description": "Big Commerce Custom Sites",
    "image": "/health-commerce.png",
    "username": null,
    "password": null,
    "notes": "I've coded multiple sites using their templates as a starting point, as well as incorporating an inner ReactJS app. I used HTML, CSS, SASS, and JavaScript while working on landing pages, profile pages, carts, category pages, and product pages.",
    "alt": "Site Example",
    "website": "",
    "github": "",
    "privateRepo": true
  },
  {
    "title": "College Site for Economic Development",
    "description": "Site For Promoting Jobs and Career Development",
    "image": "/college-site.png",
    "username": null,
    "password": null,
    "notes": "This is a site I didn't build but have added features and pages to. It's built with NextJS, TypeScript, and Material UI. I've added models to the Strapi backend for a page generator and also coded a plugin to receive form data from the frontend and send it to HubSpot and SendGrid. On the frontend, I've created some card components and a page generator for job data.",
    "alt": "Site Example",
    "website": "",
    "github": "",
    "privateRepo": true
  }
]
