[
  {
    "title": "Personal Site (this site)",
    "description": "Personal site to showcase my work",
    "image": "/personal-site.gif",
    "username": null,
    "password": null,
    "notes": "I created this site to showcase a bit about myself and share my journey into software engineering. I opted for a minimalistic design to highlight key insights I've gained from my professional programming experience. I used NextJS, Tailwind CSS, and TypeScript to build the site and deployed it to Vercel.",
    "alt": "Personal Site Photo",
    "website": "https://benjaminklarer.com",
    "github": "https://github.com/bklarer/personal-site",
    "github2": "",
    "privateRepo": false
  },
  {
    "title": "Draw Mate (WIP)",
    "description": "App for Drawing Names for Gift Exchange",
    "image": "/draw-mate.png",
    "username": null,
    "password": null,
    "notes": "The app is a work in progress, being developed to facilitate name drawing for gift exchanges. I am using NextJS, Shadcn, Tailwind CSS, and TypeScript for the frontend development. The backend is constructed with Rails and PostgreSQL. For deployment, I'm using Render for the backend and Vercel for the frontend. Although the project is still in its early stages, most of the backend is complete, and I'm now beginning work on the frontend.",
    "alt": "Draw Mate Site Photo",
    "website": "https://draw-mate.vercel.app/",
    "github": "https://github.com/bklarer/draw-mate-frontend",
    "github2": "https://github.com/bklarer/draw-mate-api",
    "privateRepo": false
  },
  {
    "title": "Firm Management App",
    "description": "Schedule Tasks within a firm",
    "image": "/firm-management.png",
    "username": "testing",
    "password": "test",
    "notes": "For my capstone project at Flatiron School, I developed an internal management application aimed at improving task assignment processes within an organization. This project afforded me the opportunity to acquire new skills in Git branching, SCSS, Cloudinary, and Action Mailer, while also enhancing my understanding of Redux, ReactJS, PostgreSQL, and Rails. Please note that the server may take a minute to spin up and might not respond immediately on the free plan.",
    "alt": "Firm Management App Photo",
    "website": "https://firm-management.onrender.com/",
    "github": "https://github.com/bklarer/firm-management",
    "github2": "",
    "privateRepo": false
  },
  {
    "title": "Event App",
    "description": "App to schedule events and see who is going",
    "image": "/event-app.png",
    "username": "testing",
    "password": "test",
    "notes": "During my time at Flatiron School, I created an event app that allows users to create events and track attendance. Through this app, I learned global state management with Redux and employed Bootstrap for simple styling. This was the first app where I integrated authorization with ReactJS and Rails, ensuring that actions and events were user-specific. Please note that the server may take a minute to spin up and might not respond immediately on the free plan.",
    "alt": "Event App Photo",
    "website": "https://event-app-26zc.onrender.com/",
    "github": "https://github.com/bklarer/event-app",
    "github2": "",
    "privateRepo": false
  }
]
